backend/app/controllers/projects_controller.rb

INSERT INTO "user_projects" ("user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["project_id", 3], ["created_at", "2020-10-18 21:39:04.158721"], ["updated_at", "2020-10-18 21:39:04.158721"]]
---
    def create
        @project = Project.new(project_params)
        @project.user = current_user

        if @project.save

SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."project_id" = $1  [["project_id", 6]]
---
    def edit
        @project = Project.find(params[:id])

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 6]]
---
    def destroy
        if @project.user == current_user
            @project.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_project
        @project = Project.find(params[:id])