backend/app/controllers/swim_lanes_controller.rb

    def create
        @swim_lane = SwimLane.new(swim_lane_params)
        @swim_lane.project.user = current_user

        if @swim_lane.save
---
INSERT INTO "swim_lanes" ("title", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "New Swimlane"], ["project_id", 7], ["created_at", "2020-10-21 20:54:05.845997"], ["updated_at", "2020-10-21 20:54:05.845997"]]

    def find_swim_lane
        @swim_lane = SwimLane.find(params[:id])
---
SELECT "swim_lanes".* FROM "swim_lanes" WHERE "swim_lanes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]