backend/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "swim_lane_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test"], ["swim_lane_id", 17], ["created_at", "2020-10-21 20:28:28.065868"], ["updated_at", "2020-10-21 20:28:28.065868"]]
---
    def create

        @task = Task.create(title: params[:title], swim_lane_id: params[:swim_lane_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 62], ["LIMIT", 1]]
---
    def find_task
        @task = Task.find(params[:id])