backend/app/controllers/user_projects_controller.rb

SELECT "user_projects".* FROM "user_projects"
---
    def index
        @user_project = UserProject.all

SELECT "user_projects".* FROM "user_projects" WHERE "user_projects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def find_user_project
        @user_project = UserProject.find(params[:id])