backend/app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "age" = $2, "email" = $3, "phone" = $4, "skill" = $5, "work" = $6, "education" = $7, "updated_at" = $8 WHERE "users"."id" = $9  [["name", ""], ["age", 0], ["email", ""], ["phone", ""], ["skill", ""], ["work", ""], ["education", "test 123"], ["updated_at", "2020-10-13 18:47:27.845249"], ["id", 2]]